In [9]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [10]:
df = pd.read_csv("Titanic Dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Gender
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,S,male
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,C,female
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,female
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,S,female
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,S,male

In [11]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
Gender          object
dtype: object

In [12]:
# Nominal category and Ordinal category

nom_data = ["Name", "Ticket", "Cabin"]
ord_data = ["Embarked", "Gender"]

In [13]:
# Gender
df["Gender"].value_counts()

Gender
male      127
female     68
Name: count, dtype: int64

In [14]:
# Label Encoding for column Gender

gen_cat = ["male", "female"]
df["Gender"] = pd.Categorical(df["Gender"], gen_cat, ordered=True)
median_index = np.median(df["Gender"].cat.codes)
median_gen = gen_cat[int(median_index)]
print("Median of column Gender:", median_gen)

Median of column Gender: male

In [15]:
# Embarked
df["Embarked"].value_counts()

Embarked
S    142
C     36
Q     17
Name: count, dtype: int64

In [16]:
# Label Encoding for column Embarked

em_cat = ["S", "C", "Q"]
df["Embarked"] = pd.Categorical(df["Embarked"], em_cat, ordered=True)
median_index = np.median(df["Embarked"].cat.codes)
median_em = em_cat[int(median_index)]
print("Median of column Embarked:", median_em)

Median of column Embarked: S